models/versie1.tex
% Created 2023-05-16 di 22:15
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{nerd}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={nerd},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.3)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Wat was het lastigste om uit te vinden of te maken?}
\label{sec:orga2f137c}
Het uitvinden van werken en updaten van de database was de lastigste taak tot nu toe. Ik gebruik de api key van tmdb zo dat er telkens gekeken wordt of de data in eigen database zit. Zoniet, slaat hij de opgevraagde tmdb info op in mijn iamddb database.
Dit kostte onverwacht veel energie.
\section{Waar en waarom ben je afgeweken van het oorspronkelijke ontwerp?}
\label{sec:org68a53df}
Ik heb besloten mijn website minimaler te maken dan mijn oorspronkelijke ontwerp. Dit is nog niet te zien aangezien ik vooral met het opzetten van database bezig ben geweest.
\section{Wat is er nog onzeker aan het project en hoe ga je dit uitzoeken?}
\label{sec:org99be607}
Het is nog onzeker hoe de website eruit gaat zien. Dit laat ik nog een beetje open. Maar voor episodes, kan je dus per season zeggen t/m welke episode je hebt gekeken of wil kijken. Ik weet nog niet helemaal hoe ik dit ga vormgeven.
\section{Wat is het eerstvolgende waar je aan gaat werken en waarom?}
\label{sec:orgb6a49bb}
De database zal eind van de week klaar zijn, daarna ga ik beginnen aan serie paginas opzetten en watched list maken. 
\section{Ontbreekt er nog iets fundamenteels, bijvoorbeeld omdat het lastiger was dan verwacht, of dat een alternatief toch handiger is? Beschrijf dan kort wat er aan de hand is.}
\label{sec:org54d7253}
Er ontbreekt nog de functie van lijsten maken, films in je watched en to watch list zetten. Verder ontbreekt er nog design van de pagina's.
\end{document}
